// Эта строка кода не выполнится. Однострочный комментарий.

/*
Все эти строки кода не выполнятся.
Так как это многострочный комментарий.
*/

// 50 * (42 / 100); Comand

// Типы данных
// -Примитивные типы данных

var AgeLore;

// Вывод в консоль
console.log(100); // Number
console.log(1.5); // Number
console.log('Hello, World'); // String
console.log(true); // Boolean
console.log('Hello, World' - 2); // NaN
console.log(AgeLore); // undefined


// -Сложные типы данных
console.log([50, 320, 480]);
console.log({meal: 'Завтрак', energy: 50});

// Переменные
// camelCase (верблюжья нотация) и snake_case (змеиная нотация)

var имяПеременной = 300;
console.log(имяПеременной);

/*
Во-первых, команда var для создания каждой переменной используется всего один раз.
Дальше вы обращаетесь к переменной по её имени, без var.
*/

// Операции

50 + 100;
+1

/*
Операция сложения — бинарная, так как в ней два операнда. Бинарные операции самые распространённые.
Но существуют и унарные операции, с одним операндом, и тернарные операции, с тремя операндами.
*/

/*
Сложение	+
Вычитание	-
Умножение	*
Деление	/
*/

/*
Из-за того, что JavaScript умеет изменять тип операндов на лету, он называется языком с динамическим приведением типов.
*/




