// Выражения
// Выражение — это часть кода, которая преобразуется в значение.

// Операторы
// То, что воздействует на выражения и заставляет их работать, называется оператором.

// Приоритет операторов
// Использование скобок
var a = 1 + ((2 * 3) / 4);
console.log(a);  // результат: 2.5

// Типы операторов
// Операторы присваивания =

/*
Операторы сравнения
== Равно 
!= Не равно 
=== Строго равно
!== Строго не равно
> Больше
>= Больше или равно
< Меньше
<= Меньше или равно
*/

/*
Арифметические операторы
+ Сложение
- Вычитание
* Умножение
/ Деление
% Взятие остатка
++ Инкремент
- Декремент
*/

// Строковый оператор конкатенации +

// Поразрядные операторы